shopbangiay/app/Http/Controllers/Admin/AdminAboutController.php

select * from `abouts`
---
    public function index()
    {
        $viewData = [];
        $viewData["title"] = "Admin Page - About - Shoe's Store";
        $viewData["abouts"] = About::all();

insert into `abouts` (`name`, `maindes`, `ratio1`, `ratio2`, `description`, `updated_at`, `created_at`) values ('Shoe\'s Store shop bán giày uy tín - chất lượng - an toàn', 'Công ty Louis Vuitton (được biết đến nhiều hơn dưới tên gọi đơn giản là Louis Vuitton) là một công ty và nhãn hiệu thời trang xa xỉ của Pháp, có trụ sở tại Paris, Pháp. Đây là một ban của công ty cổ phần Pháp LVMH Louis Vuitton Moët Hennessy S.A. Công ty được đặt tên theo tên người sáng lập ra hãng là Louis Vuitton', 'https://www.youtube.com/embed/uyLZfCUfQGI', 'https://www.youtube.com/embed/Bw_G4h75-Q0', 'Nike, Inc. (/ˈnaɪki/ hoặc /ˈnaɪk/)[note 1] là một tập đoàn đa quốc gia của Hoa Kỳ tham gia thiết kế, phát triển, sản xuất, tiếp thị và bán giày dép trên toàn thế giới, may mặc, thiết bị, phụ kiện và dịch vụ. Công ty có trụ sở chính gần Beaverton, Oregon, trong vùng đô thị Portland.', '2023-03-02 19:34:05', '2023-03-02 19:34:05')
---
    public function store(Request $request)
    {
        $request->validate([
            "name" => "required|max:255",
        ]);
        $newAbout = new About();
        $newAbout->setName($request->input('name'));
        $newAbout->setMainDescription($request->input('maindes'));
        $newAbout->setRatio1($request->input('ratio1'));
        $newAbout->setRatio2($request->input('ratio2'));
        $newAbout->setDescription($request->input('description'));
        $newAbout->save();

delete from `abouts` where `id` = 2
---
    public function delete($id)
    {
        About::destroy($id);

select * from `abouts` where `id` in ('2')
---
    public function edit($id)
    {
        $viewData = [];
        $viewData["title"] = "Admin Page - Edit About Product - Shoe's Store";
        $viewData["about"] = About::findOrFail($id);