shopbangiay/app/Http/Controllers/Admin/AdminTypeProductController.php

    public function index()
    {
        $viewData = [];
        $viewData["title"] = "Admin Page - Type Product - Shoe's Store";
        $viewData["typepdts"] = Typepdt::all();
---
select * from `typepdts`

    public function store(Request $request)
    {
        $request->validate([
            "type" => "required|max:255",
        ]);
        $newTypepdt = new Typepdt();
        $newTypepdt->setType($request->input('type'));
        $newTypepdt->save();
---
insert into `typepdts` (`type`, `updated_at`, `created_at`) values ('Louis Vuitton', '2023-03-02 19:27:09', '2023-03-02 19:27:09')

    public function delete($id)
    {
        Typepdt::destroy($id);
---
delete from `typepdts` where `id` = 2

    public function edit($id)
    {
        $viewData = [];
        $viewData["title"] = "Admin Page - Edit Type Product - Shoe's Store";
        $viewData["typepdt"] = Typepdt::findOrFail($id);
---
select * from `typepdts` where `typepdts`.`id` = '3' limit 1