shopbangiay/app/Http/Controllers/Admin/AdminProductController.php

select * from `products`
---
    public function index()
    {
        $viewData = [];
        $viewData["title"] = "Admin Page - Products - Shoe's Store";
        $viewData["products"] = Product::all();

insert into `products` (`name`, `description`, `price`, `image`, `typepdt_id`, `size`, `trademark`, `updated_at`, `created_at`) values ('xsxwx', 'wsxwsx', '232', 'game.png', '13', '35', 'wx', '2023-03-03 03:32:52', '2023-03-03 03:32:52')
---
    public function store(Request $request)
    {
        $request->validate([
            "name" => "required|max:255",
            "description" => "required",
            "price" => "required|numeric|gt:0",
            'image' => 'image',
            'trademark' => 'required',
        ]);
        $newProduct = new Product();
        $newProduct->setName($request->input('name'));
        $newProduct->setDescription($request->input('description'));
        $newProduct->setPrice($request->input('price'));
        $newProduct->setImage("game.png");
        $newProduct->setTypepdt($request->input('typepdt_id'));
        $newProduct->setSize($request->input('size'));
        $newProduct->setTrademark($request->input('trademark'));
        $newProduct->save();

select * from `products` where `products`.`id` = '2' limit 1
---
    public function edit($id)
    {
        $viewData = [];
        $viewData["title"] = "Admin Page - Edit Product - Shoe's Store";
        $viewData["product"] = Product::findOrFail($id);