shopbangiay/app/Http/Controllers/AboutController.php

    public function index()
    {
        $viewData = [];
        $viewData["title"] = "About - Shoe's Store";
        $viewData["about"] = About::all();
---
select * from `abouts`