shopbangiay/app/Http/Controllers/CartController.php

   public function purchase(Request $request)
   {
      $productsInSession = $request->session()->get("products");
      if ($productsInSession) {
         $userId = Auth::user()->getId();
         $order = new Order();
         $order->setUserId($userId);
         $order->setTotal(0);
         $order->setTrangthai("Đặt hàng thành công");
         $order->save();
         $total = 0;
         $productsInCart = Product::findMany(array_keys($productsInSession));
         foreach ($productsInCart as $product) {
            $quantity = $productsInSession[$product->getId()];
            $item = new Item();
            $item->setQuantity($quantity);
            $item->setPrice($product->getPrice());
            $item->setProductId($product->getId());
            $item->setOrderId($order->getId());
            $item->save();
            $total = $total + ($product->getPrice() * $quantity);
         }
         $order->setTotal($total);
         $order->save();
         $newBalance = Auth::user()->getBalance() - $total;
         Auth::user()->setBalance($newBalance);
         Auth::user()->save();
---
insert into `orders` (`user_id`, `total`, `trangthai`, `updated_at`, `created_at`) values (1, 0, 'Đặt hàng thành công', '2023-03-03 08:04:41', '2023-03-03 08:04:41')
insert into `items` (`quantity`, `price`, `product_id`, `order_id`, `updated_at`, `created_at`) values ('4', 150, 2, 1, '2023-03-03 08:04:41', '2023-03-03 08:04:41')
update `users` set `balance` = 4400, `users`.`updated_at` = '2023-03-03 08:04:41' where `id` = 1