shopbangiay/app/Http/Controllers/MyAccountController.php

select * from `orders` where `user_id` = 1
---
    public function orders()
    {
        $viewData = [];
        $viewData["title"] = "My Orders - Shoe's Store";
        $viewData["subtitle"] = "My Orders";
        $viewData["orders"] = Order::where('user_id', Auth::user()->getId())->get();