shopbangiay/app/Http/Controllers/ProductController.php

    public function index()
    {
        $viewData = [];
        $viewData["title"] = "Products - Shoe's Store";
        $viewData["subtitle"] = "List of products";
        $viewData["products"] = Product::all();
---
select * from `products`

    public function show($id)
    {
        $viewData = [];
        // $product = ProductController::$products[$id - 1];
        $product = Product::findOrFail($id);
---
select * from `products` where `products`.`id` = '1' limit 1