shopbangiay/app/Http/Controllers/TypeProductController.php

    public function index()
    {
        $viewData = [];
        $viewData["title"] = "Type Product - Shoe's Store";
        $viewData["subtitle"] = "List of type products";
        $viewData["typepdts"] = Typepdt::all();
---
select * from `typepdts`